1) Изучаем стандарты оформления кода
https://www.php-fig.org/psr/psr-1/
https://www.php-fig.org/psr/psr-12/
<!-- 2) Формы редактирования и создания должны быть реализованы отдельными страницами (модальное окно пойдет) -->
<!-- 3) Пароли хешируем -->
<!-- 4) Делаем нормальную валидацию, подставляем введенные данные в форму, если валидацию данные не прошли -->
<!-- 5) RESTful api - читаем -->
<!-- 6) Создаем 1000 пользователей в системе -->
<!-- 7) Добавляем ролевую модель, админ и пользователь -->

От себя:
<!-- 8) Soft Deletes -->
<!-- Удаление = добавление в колонку deleted_at даты удаления. -->
<!-- Поставить условие игорирования строк с !NULL колонки deleted_at. -->
<!-- 9) Pagination -->

<!-- Пользователь НЕ МОЖЕТ изменять данные
Администратор соответственно может
Админ может менять пароль пользователям
Админа можно сделать только через админку
Первого админа заводим напрямую в БД -->

В понедельниик 12:00 ревью
